[
  {
    "author": "r96sk",
    "author_details": {
      "name": "",
      "username": "r96sk",
      "avatar_path": "/mwR7rFHoDcobAx1i61I3skzMW3U.jpg",
      "rating": 7
    },
    "content": "It's fine, just nothing all that memorable.\r\n\r\nI had a pleasant enough time viewing <em>'Bob Marley: One Love'</em>, though it does kinda seem a bit hollow post-watch - as in I don't feel like I've learned much nor actually seen that much, the movie has like three noteworthy events but then that's kinda it. The music from those involved also didn't feel amazingly utilised, I guess they didn't want it to be too jukebox-y.\r\n\r\nKingsley Ben-Adir does well in the lead role as Bob Marley himself. I'm not a Marley superfan or anything close, I basically only know his biggest hits, but the resemblance of Ben-Adir seemed off to me - a thought that was only solidified when the real Marley appears via archive footage at the end. Perhaps that's just me, though.\r\n\r\nLashana Lynch gives a good performance, spearheading the rest of the cast who are alright; interesting to see James Norton, Michael Gandolfini too... even if I didn't realise it was Gandolfini until the credits. Overall, it does feel like the film only scratches the surface of Marley's life. I wanted more from it, but to be fair it is still a decent flick in my opinion.",
    "created_at": "2024-02-14T17:47:56.013Z",
    "id": "65ccfccb1365450186a25ecd",
    "updated_at": "2024-02-14T17:47:56.146Z",
    "url": "https://www.themoviedb.org/review/65ccfccb1365450186a25ecd"
  },
  {
    "author": "CinemaSerf",
    "author_details": {
      "name": "CinemaSerf",
      "username": "Geronimo1967",
      "avatar_path": "/1kks3YnVkpyQxzw36CObFPvhL5f.jpg",
      "rating": 6
    },
    "content": "Sadly, this is one of those films that shoves almost all of it's best bits into the trails. What's left is a curiously sterile representation of the life of this vibrant and visionary man. To be fair, Kingsley Ben-Amir does turn in quite a charismatic performance, but the rest of that characters are largely under-cooked and seem there to make up the numbers. We get little by way of establishment. Why is he revered on his home island of Jamaica at the start? We are plonked into the centre of a political hotbed and then all to briefly, bullets are flying and we are in London, his family in Delaware. Again, little meat on the bones of context there for us to understand just what was going on and why he was so important to both sides in that conflict - alive or dead. The last twenty minutes does allow for more of his musical talents to shine, and KBA delivers them enthusiastically and engagingly, but somehow I just felt this was the thinnest of coats about his enigma. James Norton just looked like he was along because he liked the music and Lashana Lynch is totally unremarkable too. Son Ziggy may well have had a hand in this, but it really under-delivers on a story that I thought should have been a no-brainer politically, musically and culturally. Sorry, this is just a rather disappointing chronology that skirts across his life like a stylus on well worn vinyl. Pity.",
    "created_at": "2024-02-16T06:46:23.854Z",
    "id": "65cf04bffdf8b7014966ef66",
    "updated_at": "2024-02-16T06:46:23.973Z",
    "url": "https://www.themoviedb.org/review/65cf04bffdf8b7014966ef66"
  },
  {
    "author": "Manuel São Bento",
    "author_details": {
      "name": "Manuel São Bento",
      "username": "msbreviews",
      "avatar_path": null,
      "rating": 5
    },
    "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/bob-marley-one-love-review-a-sanitized-homage/\r\n\r\n\"Bob Marley: One Love navigates the intricacies of biographical storytelling with mixed success. Its commendable focus on Marley’s message and music, coupled with good performances, highlights the enduring relevance of his legacy.\r\n\r\nHowever, the reluctance to engage with the more contentious aspects of his life and the oversimplification of his political contributions undermine the potential for a more nuanced, complete exploration.\r\n\r\nWhile the movie serves as a vibrant homage to Marley’s spirit and artistry, it ultimately leaves me yearning for a deeper, more critical study of the complexities that defined one of the most influential artists of the 20th century.\"\r\n\r\nRating: C",
    "created_at": "2024-02-16T20:15:07.640Z",
    "id": "65cfc24be04d8a0163c215ef",
    "updated_at": "2024-02-16T20:15:07.740Z",
    "url": "https://www.themoviedb.org/review/65cfc24be04d8a0163c215ef"
  }
]
